{
  "basics": {
    "name": "Mrugesh Mohapatra",
    "label": "Senior Software Engineer",
    "picture": "",
    "email": "me@raisedadead.com",
    "phone": "+91 8149649603",
    "website": "https://raisedadead.com",
    "summary": "I am 27 and I love developing applications for the Desk, Web, and Mobile. I have a nerdy knowledge about programming in C++ and JavaScript. I am a trained professional on Image Processing, CAD & 3D Modelling. My latest endeavors are Open Source projects in JavaScript (both on web and backend), including libraries and frameworks like Three.js, Node.js, MongoDB, Git, and HTML5. I have a newbie experience of developing Android apps. I love designing in Photoshop. For my day job at Dassault Systemes, I work on CATIA WebApps for CAD domain on JavaScript in Three.js (WebGL). For my Open Source initiatives, I contribute to the freeCodeCamp.com's codebase, wiki and tools on Github as a Core Team Member. In the past, I have worked largely on Windows Platforms, including developing solutions in MFC, COM, CLR and Visual C++. I was born in the temple city, Bhubaneswar, IN and currently camping in Pune, IN. I did my B.Tech in CSE from Synergy Institute of Engineering and Technology. I stayed in Mumbai, IN for a while. I am a hardcore Music addict and Open Source Enthusiast. Besides being hooked to my Notebook, I love going to rock gigs and night-outs with my buddies. I believe in God but not in Symbols. I trust myself. I love being me.",
    "location": {
      "address": "",
      "postalCode": "411057",
      "city": "Pune",
      "countryCode": "IN",
      "region": "Maharashtra"
    },
    "profiles": [
      {
        "network": "twitter",
        "username": "raisedadead",
        "url": "https://www.twitter.com/raisedadead"
      },
      {
        "network": "Linkedin",
        "username": "mrugeshm",
        "url": "https://www.linkedin.com/in/mrugeshm"
      },
      {
        "network": "GitHub",
        "username": "raisedadead",
        "url": "https://www.github.com/raisedadead"
      },
      {
        "network": "Blog",
        "username": "",
        "url": "https://blog.raisedadead.com"
      }
    ]
  },
  "work": [
    {
      "company": "Dassault Systèmes",
      "position": "Senior Software Engineer",
      "website": "https://3ds.com",
      "startDate": "2015-05",
      "endDate": "0000-00",
      "summary": "Currently, the role requires the development of new features and prototype for the 3D Web Apps on the 3DExperience platform by Dassault Systèmes. Challenges include prototyping Web Apps in JavaScript, HTML5, and modern web technologies, such as WebGL, ThreeJS, RequireJS, AMD, MVC, and more. Gained expertise on Web technologies as mentioned, which is yet again a new horizon, from the traditional technical background in previous engagements. The role also requires the browser plugins (in C++), to be supported for the platform migrations and clients working with legacy systems. Have been an active member of the Techies Club and participated as a mentor in Hackathons conducted in-house at 3DPLM Functional role requires mentoring and guiding junior team members in their assigned tasks and technical challenges.",
      "highlights": []
    },
    {
      "company": "Dassault Systèmes",
      "position": "Software Engineer",
      "website": "https://3ds.com",
      "startDate": "2014-06",
      "endDate": "2015-05",
      "summary": "Got hands on expertise in developing, and supporting plugins for the CATIA - ENOVIA V5, V6 Product Suites. Technologies included browser plugins for Mozilla Firefox (Gecko Infrastructure) and Internet Explorer (using ActiveX Infrastructure). Learnt and developed modules in CAA, C++ using the Internal tool suite for Dassault Systemes. Key challenges included gaining a grasp on the CAD & PLM concepts, which is a paradigm shift from my past experience. During the period got exposure to prototyping new features for the 3D Viewer plugins. The functional role required participation and coordination in managing the team deliverables while ensuring the quality benchmarks and high standards expected by Dassault Systèmes.",
      "highlights": []
    },
    {
      "company": "Wipro Limited",
      "position": "Project Engineer (Senior Developer)",
      "website": "https://wipro.com",
      "startDate": "2013-02",
      "endDate": "2014-06",
      "summary": "Gained Hands on Expertise in Developing and Maintaining Applications on Windows Platform with skills MFC and Command Line Utility Programming in Visual C++. Responsible in Designing, developing and Maintaining Image Processing Applications and frameworks. Key challenges included developing algorithms to support multiple Imaging formats, design and develop components of the existing applications using COM modules, and Framework Libraries (DLL) to deliver quality products that have target platforms ranging from Windows XP to Windows 8. Gained upfront hands on skills in Visual Studio 2005, 2008 and 2010. Visual C++, Software Configuration Management, Windows API, MFC Application Development and CLI Application Development and COM and ATL.",
      "highlights": []
    },
    {
      "company": "Wipro Limited",
      "position": "Project Engineer (Junior Developer)",
      "website": "https://wipro.com",
      "startDate": "2012-01",
      "endDate": "2013-02",
      "summary": "Trained on the Unix platform with expertise in C, C++, Shell scripting, Socket programming, Unix System Internals and Unit Testing. Was responsible as a Junior Developer in a classified project that required the critical development of code snippets in C, C++, Shell Script.",
      "highlights": []
    }
  ],
  "volunteer": [
    {
      "organization": "freeCodeCamp",
      "position": "Core Team Member",
      "website": "https://freecodecamp.org",
      "startDate": "2015-11",
      "endDate": "0000-00",
      "summary": "",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "Biju Pattnaik University of Technology",
      "area": "Computer Science Engineering",
      "studyType": "Bachelor of Technology",
      "startDate": "2007",
      "endDate": "2011",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Kendriya Vidyalaya No. 1, Bhubaneswar",
      "area": "All India Senior School Certificate Examination (12th CBSE)",
      "studyType": "",
      "startDate": "2005",
      "endDate": "2007",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Kendriya Vidyalaya, ONGC, Panvel, Mumbai",
      "area": "All India Secondary School Examination (10th CBSE)",
      "studyType": "",
      "startDate": "NA",
      "endDate": "2005",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": []
}